app/views/snips/_like.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."snip_id" = 1 AND "likes"."user_id" = 1 LIMIT 1
---
<% if snip.likes.find_by_user_id(current_user.id).present? %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."snip_id" = 1
---
<%= link_to [:likes, snip], :class => 'btn btn-tiny' do %>
<span class="like-count"><%= snip.likes.count %></span>