app/views/snips/_snip.html.erb

			<%= link_to snip, :class => 'btn btn-tiny' do %>
			<%= snip.comments.count %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."snip_id" = 1