app/controllers/images_controller.rb

  def create
    @image = Image.new(params[:image])
    @snip = current_user.snips.build(params[:snip])
    @image.snip = @snip
    if @image.save
---
INSERT INTO "images" ("created_at", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "snips" ("created_at", "desc", "name", "snip_id", "snip_type", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"