app/controllers/notifications_controller.rb

SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = 1
---
  def index
    @notifications = current_user.notifications.paginate(page: params[:page], per_page: 10)