app/controllers/relationships_controller.rb

  def show
    @notification = Notification.where(:user_id => current_user.id, :notify_id => params[:id], :notify_type => 'Relationship').first
    @notification.update_attributes(:read => true)
---
SELECT "notifications".* FROM "notifications" WHERE (("notifications"."user_id" = 1 AND "notifications"."notify_id" = 1 AND "notifications"."notify_type" = 'Relationship')) ORDER BY created_at DESC LIMIT 1
UPDATE "notifications" SET "read" = 't', "updated_at" = '2014-02-27 23:01:49.737517' WHERE "notifications"."id" = 1