app/controllers/search_controller.rb

  def search
    @users = User.search params[:q]
---
SELECT "users".* FROM "users" WHERE (username LIKE '%Drenerdist')

  def users
    @users = User.search params[:q]
---
SELECT "users".* FROM "users" WHERE (name LIKE '%%')