app/controllers/snips_controller.rb

SELECT "snips".* FROM "snips" WHERE "snips"."id" = $1 ORDER BY id DESC LIMIT 1  [["id", "2"]]
DELETE FROM "snips" WHERE "snips"."id" = $1  [["id", 2]]
---
  def destroy
    @snip = Snip.find(params[:id])
    @snip.destroy

SELECT "snips".* FROM "snips" WHERE "snips"."id" = ? ORDER BY id DESC LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."snip_id" = 1 ORDER BY comments.created_at DESC
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = 1 ORDER BY created_at DESC LIMIT 5
---
  def show
    @snip = Snip.find(params[:id])
    @snip.comments.each do |comment|
      @notification = Notification.where(:user_id => current_user.id, :notify_id => comment.id, :notify_type => 'Comment').first