app/controllers/users_controller.rb

  def show
    @user = User.find_by_username(params[:id])
    if current_user?(@user)
      composer
      new_resume
    end
    @snips = @user.snips.paginate(page: params[:page], per_page: 10)
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'Drenerdist' LIMIT 1
SELECT "snips".* FROM "snips" WHERE "snips"."user_id" = 1 ORDER BY id DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "snips" WHERE "snips"."user_id" = 1

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "location" = '', "picture_file_name" = '20140207_211253_972.jpg', "picture_content_type" = 'image/jpeg', "picture_file_size" = 386236, "picture_updated_at" = '2014-03-06 06:03:17.555515', "about" = '' WHERE "users"."id" = 1

  def following
    @user = User.find_by_username(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'Dredanerdist' LIMIT 1

  def followers
    @user = User.find_by_username(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'Dredanerdist' LIMIT 1

  def resume
    @user = User.find_by_username(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'Drenerdist' LIMIT 1

  def messages
    @user = User.find_by_username(params[:id])
    @messages = Message.thread(@user, current_user)
    @messages.each do |m|
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'Drenerdo' LIMIT 1
SELECT "messages".* FROM "messages" WHERE (( user_id = 1 AND to_id = 2 ) or ( user_id = 2 AND to_id = 1 )) ORDER BY created_at DESC