app/controllers/videos_controller.rb

INSERT INTO "snips" ("created_at", "desc", "name", "snip_id", "snip_type", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "videos" ("created_at", "updated_at", "vimeo") VALUES (?, ?, ?)  [["created_at", Sun, 12 Jan 2014 07:05:39 UTC +00:00], ["updated_at", Sun, 12 Jan 2014 07:05:39 UTC +00:00], ["vimeo", "14113583"]]
---
  def create
    @video = Video.new(params[:video])
    @snip = current_user.snips.build(params[:snip])
    @video.snip = @snip
    if @video.save