app/controllers/welcome_controller.rb

  def index
    if user_signed_in?
      @feed = current_user.feed.paginate(page: params[:page], per_page: 9)
    else
      @snips = Snip.where(:snip_type => "Image").paginate(page: params[:page], per_page: 9)
---
SELECT "snips".* FROM "snips" WHERE "snips"."snip_type" = 'Image' ORDER BY id DESC LIMIT 9 OFFSET 0