app/views/layouts/_header.html.erb

				<a href="#" class="dropdown-toggle" data-toggle="dropdown"><i class="icon icon-white icon-globe"></i>
					<% if current_user.notifications.where(:read => false).count > 0 %>
---
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = 1 AND "notifications"."read" = 'f'

				<ul class="dropdown-menu">
					<% current_user.notifications.limit(5).each do |n| %>
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = 1 ORDER BY created_at DESC LIMIT 5